import { title } from "@/components/primitives";
import Image from "next/image";

export default function AboutPage() {
  return (
    <div>
      <h1 className={title()}>SEO</h1>
      <h2 className="text-center">Каквo е SEO?</h2>
      <Image className="page-img" src={"https://powweb.space/wp-content/uploads/2024/07/analiz.jpg"} width={700} height={406} alt="SEO от Powweb.bg"/>
      <p>SEO (Search Engine Optimisation) е акроним, който се отличава с оптимизацията за търсачки.</p>
      <p>Това е стратегия, използвана от собствениците на уеб сайтове, за да получaт по-голям трафик, като се класират по-високо в търсачките.</p>
      <p>Оптимизирането на търсещите машини не е измама на Google. Това е просто създаване на уеб сайт, който има оптимизиран код, който улеснява търсачките да го намерят.</p>
      <p>Когато хората търсят в мрежата темите, за които пишете, оптимизираното от търсещите машини съдържание ще се покаже по-високо в резултатите от търсенето и ще ще се увеличи броят на хора, които посещават уебсайта Ви.</p>
      <p><strong>Подобряване на вашaта SEO оптимизация е от решаващо значение за получаване на повече трафик към вашия уеб сайт.</strong></p>
      <h2 className="text-center">Защо е важна SEO оптимизацията?</h2>
      <p>Търсачките често са най-големият източник на трафик за повечето уеб сайтове.</p>
      <p>Google и други търсачки използват усъвършенствани алгоритми, за да разбират и класират страниците по подходящ начин в резултатите от търсенето. Но тези алгоритми не са съвършени - те все още се нуждаят от вашата помощ, за да разберат какво е и оценят вашето съдържание.</p>
      <p>Ако съдържанието ви не е оптимизирано, търсачките няма да знаят как да го класират. Когато хората търсят темите, за които пишете, вашият уебсайт няма да се появи в резултатите от търсенето и ще пропуснете голяма част от този трафик.</p>
      <p>Много е важно сайтът ви да е оптимизиран за търсещите машини, така че да може да увеличите максимално трафика си в мрежата за търсене.</p>
      <h2 className="text-center">On-Page SEO е практика за оптимизиране на отделните уеб страници,</h2>
      <p>за да се класира по-високо съдържанието и съответно, да се увеличи органичния трафик от търсачките - посещенията. On-Page SEO се прилага за съдържанието и HTML кода на сайтът, за разлика от Off-Page SEO оптимизацията, която се отнася до линковете и други външни сигнали.</p>
      <p>За индексирането на вашият сайт, най-голяма роля играят: Качеството и историята на домейна, On-Page SEO (вътрешна) и Off-Page (външна) SEO оптимизация или линк билдинг.</p>
      <p>Линк билдинга, казано накратко е натрупване на връзки (линкове) от други домейни (сайтове) към вашият.
      При този вид оптимизация трябва да се набляга на качеството, а не на количеството линкове и да се внимава, защото много от методите за набавяне на тези линкове са забранени от Google и може да донесът наказание за вашият сайт.</p>
      <h3 className="my-[20px] mx-0 center">Ние предлагаме Вътрешна - On-Page SEO на достъпни цени, която включва:</h3>
      <ul>
        <li>Свързване и основни нaстройки с Google Analytics и Google Search Console (GSC или Webmasters Tools)</li>
        <li>Съставяне на robots.txt файл.</li>
        <li>Формиране на xml карта на сайта.</li>
        <li>Страница за грешка 404.</li>
        <li>Оптимизация на изображенията.</li>
        <li>Съставяне на вътрешна линк структура.</li>
        <li>SEO оптимизирани заглавия, определни чрез анализ на ключовите думи.</li>
        <li>301 редиректи, странициране, канонични връзки и др.</li>
        <li>Анализ и отчет на индексирането до 6 месеца след завършване на оптимизацията.</li>
      </ul>
      <h3 className="text-center">Допълнителни платени SEO услуги по желание:</h3>
      <ul>
        <li>Организиране на рекламна кампания в Google Adwords, Adwise.bg и Facebook.</li>
        <li>5 уникални, SEO оптимизирани статии от по 400 думи - Цена: 40лв.</li>
      </ul>
      <p>Ако и вие искате изработване на нов сайт или обновяване на съществуващ не се колебайте да се свържете с нас.</p>
      <Image className="page-img" src={"https://powweb.space/wp-content/uploads/2024/07/seo-2.jpg"} width={700} height={406} alt="SEO от Powweb.bg"/>
    </div>
  );
}
